ui/backend/audit/cases/channel_flow_rans_sst/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       9850;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-2 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       9900;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (2 0 0);
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       9950;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       10050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          10000;
        startFace       10150;
    }
)

// ************************************************************************* //
