ui/backend/audit/cases/channel_flow_rans_sst/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| Channel pressure. M9.2 cyclic: no inlet/outlet pressure BC (cyclic); the     |
| reference pressure is whatever the solver picks, only ∇p matters.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
