ui/backend/audit/cases/channel_flow_rans_sst/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| Channel turbulent viscosity. M9.2 cyclic: inlet/outlet cyclic.              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottomWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    topWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
