ui/backend/audit/cases/channel_flow_rans_sst/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
(-0.5 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
