ui/backend/audit/cases/channel_flow_rans_sst/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1.34164
1.34164
1.34164
1.34164
1.34164
1.34164
1.34164
1.34164
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1.34164
1.34164
1.34164
1.34164
1.34164
1.34164
1.34164
1.34164
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
